{
    "result": [
        [
            {
                "page": "https://loldb.me/champions/Twisted%20Fate",
                "blurb": "Twisted Fate is an infamous card sharp and swindler who has gambled and charmed his way across much of the known world, earning the enmity and admiration of the rich and foolish alike."
            },
            {
                "page": "https://loldb.me/champions/Maokai",
                "blurb": " He was twisted into a force of vengeance after a magical cataclysm destroyed his home, surviving undeath only through the waters of life infused within his heartwood."
            },
            {
                "page": "https://loldb.me/champions/Veigar",
                "blurb": " Every now and again, however, a yordle turns so bad that even at its small stature it strikes terror into the hearts of others. Veigar is one such twisted yordle."
            },
            {
                "page": "https://loldb.me/champions/Lissandra",
                "blurb": " When her human form grew old, she faked her own death and then murdered her successor to steal her identity. With each generation, the Frostguard grew more insular, cruel and twisted."
            },
            {
                "page": "https://loldb.me/champions/Vayne",
                "blurb": " Young and naive, she truly believed that her world was one of perfect safety, until one night, when a twisted witch took interest in her father."
            },
            {
                "page": "https://loldb.me/champions/Shaco",
                "blurb": " A popular belief is that Shaco is not of Runeterra - that he is a thing summoned from a dark and twisted world."
            },
            {
                "page": "https://loldb.me/champions/Alistar",
                "blurb": "<br><br>Alistar's once noble soul slowly became twisted, and he would have been driven to insanity if not for Ayelia, a young servant girl who befriended him and eventually arranged for his escape."
            },
            {
                "page": "https://loldb.me/champions/Nocturne",
                "blurb": " Physicians were baffled until a Field Architect happened to pass out next to a nexus on Twisted Treeline."
            },
            {
                "page": "https://loldb.me/champions/Master%20Yi",
                "blurb": " Recognizing the threat the Wuju disciples posed to their invasion, the Noxians chose to unleash a nightmarish chemical attack on the home of the deadly art. Those who somehow survived the poisonous concoction had their minds twisted beyond repair."
            },
            {
                "page": "https://loldb.me/champions/Zyra",
                "blurb": "Zyra summons a twisted thicket at her target location, dealing damage to enemies as it expands and knocking them airborne as it contracts."
            },
            {
                "page": "https://loldb.me/champions/Lux",
                "blurb": "Fires an anomaly of twisted light to an area, which slows nearby enemies. Lux can detonate it to damage enemies in the area of effect."
            }
        ],
        [
            {
                "page": "https://loldb.me/items/3116",
                "blurb": "Rylai's Crystal Scepter +300 Health +75 Ability Power UNIQUE Passive: Damaging spells and abilities reduce enemy movement speed by 20% for 1 second.... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3640",
                "blurb": "Flash Zone Allows team to cast Flash repeatedly in a limited zone. Creates a magic zone for your team for 5 seconds. While in this zone, you and your allies... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3682",
                "blurb": "Espresso Snax Active - Feed The King: The King leaps into the air and crashes down twice, knocking enemies away and dealing 40-190 physical damage. He... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3090",
                "blurb": "Wooglet's Witchcap +100 Ability Power +45 Armor UNIQUE Passive: Increases Ability Power by 25% UNIQUE Active: Champion becomes invulnerable and untargetable... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3635",
                "blurb": "Port Pad Deploy an additional teleport target. Places a Port Pad at target location. After a 4 second delay, it activates, allowing you or your allies... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3303",
                "blurb": "Spellthief's Edge +10 Ability Power +2 Gold per 10 seconds +25% Base Mana Regen UNIQUE Passive - Tribute: Damaging spells and attacks against champions... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/1026",
                "blurb": "Blasting Wand +40 Ability Power... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3174",
                "blurb": "Athene's Unholy Grail +30 Ability Power +30 Magic Resist +10% Cooldown Reduction +100% Base Mana Regen UNIQUE Passive: Gain 25% of the premitigation damage... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/2031",
                "blurb": "Refillable Potion Limited to 1 type of Healing Potion. UNIQUE Active: Consumes a charge to restore 125 Health over 12 seconds. Holds up to 2 charges and... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/2003",
                "blurb": "Health Potion Limited to 5 at one time. Limited to 1 type of Healing Potion. Click to Consume: Restores 150 Health over 15 seconds.... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3340",
                "blurb": "Warding Totem (Trinket) Limited to 1 Trinket. Active: Consume a charge to place an invisible Stealth Ward which reveals the surrounding area for 60 - 120... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3027",
                "blurb": "Rod of Ages +300 Health +300 Mana +60 Ability Power Passive: Grants +20 Health, +10 Mana, and +4 Ability Power per stack (max +200 Health, +100 Mana, and... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/1058",
                "blurb": "Needlessly Large Rod +60 Ability Power... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3285",
                "blurb": "Luden's Echo +100 Ability Power +10% Movement Speed UNIQUE Passive - Echo: Gain charges upon moving or casting. At 100 charges, the next damaging spell... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3157",
                "blurb": "Zhonya's Hourglass +70 Ability Power +45 Armor +10% Cooldown Reduction UNIQUE Active - Stasis: Champion becomes invulnerable and untargetable for 2.5 seconds,... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3634",
                "blurb": "Tower: Beam of Ruination Attach, then recast to fire a damaging beam from a turret to your cursor. First Cast: Attach a Slayer Beam to the target turret... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/2139",
                "blurb": "Elixir of Sorcery Level 9 required to purchase. Click to Consume: Grants +50 Ability Power, 15 bonus Mana Regen per 5 seconds and Sorcery for 3 minutes.... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3641",
                "blurb": "Vanguard Banner Place a banner that buffs minions. Place a Vanguard Banner at target location. After a 2 second delay, any nearby minions will be granted... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3112",
                "blurb": "Guardian's Orb +150 Health +35 Ability Power +10 Mana regen per 5 seconds Limited to 1 Guardian's Item.... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3010",
                "blurb": "Catalyst of Aeons +225 Health +300 Mana UNIQUE Passive - Eternity: 15% of damage taken from champions is gained as Mana. Spending Mana restores 20% of... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3151",
                "blurb": "Liandry's Torment +80 Ability Power +300 Health UNIQUE Passive - Eyes of Pain: +15 Magic Penetration UNIQUE Passive: Spells burn enemies for 3 seconds,... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3681",
                "blurb": "Super Spicy Snax Active - Feed The King: The King breathes fire for 4 seconds, dealing 705-1479 true damage over the duration to enemies caught in the... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3001",
                "blurb": "Abyssal Mask +350 Health +300 Mana +55 Magic Resist +10% Cooldown Reduction UNIQUE Passive - Eternity: 15% of damage taken from champions is gained as... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3089",
                "blurb": "Rabadon's Deathcap +120 Ability Power UNIQUE Passive: Increases Ability Power by 35%.... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3030",
                "blurb": "Hextech GLP-800 +300 Health +400 Mana +80 Ability Power UNIQUE Passive - Eternity: 15% of damage taken from champions is gained as Mana. Spending Mana... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3165",
                "blurb": "Morellonomicon +100 Ability Power +400 Mana UNIQUE Passive: +20% Cooldown Reduction UNIQUE Passive: Dealing magic damage to champions below 35% Health... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3647",
                "blurb": "Shield Totem Place a totem that shields nearby deployables. Places a Shield Totem at target location. After a 2 second delay, the totem will activate,... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/1027",
                "blurb": "Sapphire Crystal +250 Mana... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/1056",
                "blurb": "Doran's Ring +60 Health +15 Ability Power +50% Base Mana Regen UNIQUE Passive: Restores 4 Mana upon killing a unit.... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/1028",
                "blurb": "Ruby Crystal +150 Health... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3680",
                "blurb": "Frosted Snax Active - Feed The King: The King lobs many projectiles at far-away enemies, each dealing 213-775 magic damage to targets in the center of... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3020",
                "blurb": "Sorcerer's Shoes +15 Magic Penetration UNIQUE Passive - Enhanced Movement: +45 Movement Speed... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3158",
                "blurb": "Ionian Boots of Lucidity UNIQUE Passive: +10% Cooldown Reduction UNIQUE Passive - Enhanced Movement: +45 Movement Speed UNIQUE Passive: Reduces Summoner... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/2033",
                "blurb": "Corrupting Potion Limited to 1 type of Healing Potion. UNIQUE Active: Consumes a charge to restore 125 Health and 75 Mana over 12 seconds and grants Touch... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3643",
                "blurb": "Entropy Field Stun minions and slow champions in an area. Places an Entropy Field at target location for 5 seconds. Enemy minions and Siege Ballistas trapped... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3642",
                "blurb": "Siege Refund Refunds all purchased Siege Weapons for their full price.... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3100",
                "blurb": "Lich Bane +80 Ability Power +7% Movement Speed +10% Cooldown Reduction +250 Mana UNIQUE Passive - Spellblade: After using an ability, the next basic attack... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/1001",
                "blurb": "Boots of Speed Limited to 1. UNIQUE Passive - Enhanced Movement: +25 Movement Speed... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3092",
                "blurb": "Frost Queen's Claim +60 Ability Power +10% Cooldown Reduction +2 Gold per 10 seconds +50% Base Mana Regen UNIQUE Passive - Tribute: Damaging spells and... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/2055",
                "blurb": "Control Ward Can only carry 3 Control Wards in inventory. Click to Consume: Places a ward that grants vision of the surrounding area. This device will... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3631",
                "blurb": "Siege Ballista Deploys a ballista that shoots the closest turret. Places a long range ballista if within 2200 range of an enemy turret. After a 5 second... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3135",
                "blurb": "Void Staff +80 Ability Power UNIQUE Passive: +35% Magic Penetration.... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3057",
                "blurb": "Sheen +250 Mana +10% Cooldown Reduction UNIQUE Passive - Spellblade: After using an ability, the next basic attack deals bonus physical damage equal to... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3683",
                "blurb": "Rainbow Snax Party Pack! Active - Feed The King: The King tosses many Snax behind the enemy, attracting Poros which dash back towards him. Enemy champions... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3102",
                "blurb": "Banshee's Veil +70 Ability Power +60 Magic Resist +10% Cooldown Reduction UNIQUE Passive: Grants a spell shield that blocks the next enemy ability. This... Twisted Fate"
            },
            {
                "page": "https://loldb.me/items/3636",
                "blurb": "Tower: Storm Bulwark Makes a turret go invulnerable, then rain fire. Makes the target turret invulnerable for 6 seconds. Two seconds before expiry, it... Twisted Fate"
            }
        ],
        [
            {
                "page": "https://loldb.me/maps/The%20Twisted%20Treeline",
                "blurb": "After capturing one of the two altars on Twisted Treeline champions originating from the Shadow Isles, which include  Hecarim,  Mordekaiser,  Elise,  Karthus, and  Yorick, the summoned \"spirit\" will say unique messages to those particular champions."
            },
            {
                "page": "https://loldb.me/maps/Summoner's%20Rift",
                "blurb": " It was temporarily replaced again with the Winter Version for the 2010 Snowdown Showdown. The Autumn Version uses music from the Twisted Treeline."
            }
        ],
        []
    ]
}
